SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( DEE_M7_30112
Type ( Engine )
WagonShape ( DEE_M7_30112.s )
Name ( "DEE_M7_30112 no lamps" )

Include ( ..\\Common_Locomotives\\LSWR_M7_wagon.inc )


Comment ( ******************** Freight and Load Animations (If used) ***************
                Included in this section - Freight Animation information, etc
          *********************************************************************** )

comment ( 60.2t-uk full, 51.4t-uk without coal and water, Coal 3.0t-uk, Water 5.8t-uk )
comment ( empty weight from diagram = 60.9 tons = boiler and grate also empty! )

ORTSFreightAnims (

MSTSFreightAnimEnabled (1)

WagonEmptyWeight( 51.4t-uk )
EmptyORTSDavis_A ( 1690 )
EmptyORTSDavis_B ( 36.7 )
EmptyCentreOfGravity_Y ( 1.5 )

FreightAnimContinuous (
FreightWeightWhenFull( 8.8t-uk )
ORTSDavis_A ( 2386 )
ORTSDavis_B ( 61.0 )
FullCentreOfGravity_Y ( 2.0 ) )

FreightAnimStatic (
SubType( Default )
Shape ( Pcrew.s )
Offset( 0, 0.01, 0.01 ))

Comment ( front lamp positions A 0 3.07 -4.14 // B 0.49 2.25 -4.19 / C -0.49 2.25 -4.19 // D 0.97 1.35 -4.52 / E 0 1.35 -4.52 / F -0.97 1.35 -4.52 )
Comment ( rear lamp positions A 0 3.06 5.10 // B -0.79 2.05 5.00 / C 0.79 2.05 5.00 // D -0.95 1.35 5.00 / E 0 1.35 5.00 / F 0.95 1.35 5.00 )

)

)

Engine (DEE_M7_30112

Include ( ..\\Common_Locomotives\\LSWR_M7_engine.inc )

Description (
  "Southern Railway M7 Class Express Tank Engine., modelled as it was in the 1950s/60s. "+ 
  "Designed for express suburban passenger duties, it ended its long life on empty coaching stock "+
      "duties, and push-pull passenger trains, especially on branch lines.\n\n"+ 
      "The class was built in batches between 1897 and 1911. Most survived up to the end in 1964. "+
      "Two have been preserved.\n\n"+
  "Locomotive type & no.: M7 0-4-4T\n\n"+
  "Power source: 175 psi hand-fired, coal burning boiler\n\n"+
  "Wheel configuration: Four 5ft 7in diameter driving wheels in an 0-4-4 configuration\n\n"+
  "Max. speed: 60 mph (96.6 km/h) under favorable conditions\n\n"+
  "Height: 13 ft. 2 in. \n\n"+
  "Width: 8 ft (over footplate)\n\n"+
  "Length: 33 ft. 2 in. (over bufferbeams)\n\n"+
  "Weight: 49 metric tons\n\n"+
  "Tractive effort: 19755lb (13,532.93 kg)\n\n"+
  "Coal capacity: 3.3 metric tons\n\n"+
  "Water capacity: 1,200 gallons (4,542 liters)\n\n"+
  "Brakes: Vacuum\n\n" 
 "Model copyright(c)\n"+
 "www.trainsimfiles.com - essential UK railway models.\n\n"
 "Version 0.1 beta\n"
)
 EngineOperatingProcedures (
 "To move forward\n"+
 "1. Press the W key several times to move the Reverser to full Forward.\n"+
 "2. Press the ; (SEMICOLON) key to release the train brakes.\n"+
 "3. Press the D key to increase the Regulator setting.\n"+  
 "4. As you accelerate, press the S key to slowly reduce the Reverser setting, then adjust the Regulator to maintain the desired speed.\n\n"+
 "To slow the train\n"+
 "1. Press the A key to move the Regulator to a lower setting.\n"+
 "2. Use the brakes to further reduce speed if desired.\n\n"+
 "To apply the train brakes\n"+
 "1. Press the ' (APOSTROPHE) key to apply the train brakes.\n"+
 "2. To hold the brakes at their current setting, lower the brake lever until it's in its middle (Neutral) position, by pressing the ; (SEMICOLON) key.\n\n"+
 "To release the train brakes\n"+
 "1. Press  the ; (SEMICOLON) key to release the train brakes.\n"+
 "2. When the brakes are released, raise the brake lever until it's in its middle (Neutral) position, by pressing the ' (APOSTROPHE) key.\n\n"+
 "To back up\n"+
 "1. Bring your train to a full stop.\n"+ 
 "2. Press the S key several times to move the Reverser to the full Reverse position.\n"+
 "4. Press the ; (SEMICOLON) key to release the brakes.\n"+
 "5. Slowly advance the regulator (D key).\n\n"+
 "To load and unload passengers\n"+
 "1. Stop at a station.\n"+
 "2. Press the ENTER key.\n"+
 "3. Wait for the \"permission to depart\" whistle.\n"+
 "TIP: Use the Next Station driving aid (F10) to monitor loading and unloading.\n\n"+
 "To couple to a car or locomotive\n"+
 "1. Coast into the unit at a very slow speed, about 2 mph.\n"+
 "TIP: To use the Coupling view, press the 6 key.\n"+
 "2. Press F9 to open the Train Operations window.\n"+
 "3. If the icon for the unit you coupled to is red, the handbrake is on. Double-click the car to release the handbrake.\n"+
 "4. Close the Train Operations window.\n\n"+
 "To uncouple from a car or locomotive\n"+
 "1. Press F9 to open the Train Operations window.\n"+
 "2. Double-click a unit in the part of the train you want to uncouple from the locomotive, to set the handbrake.\n"+
 "3. Double-click the coupler between the units you want to uncouple and the rest of the train.\n"+
 "4. Close the Train Operations window.\n\n"+
 "Firing commands (Automatic Fireman OFF in Options screen)\n"+
 "To add coal to the firebox\n"+
 "1. Press the F key to open the Firebox door.\n"+
 "2. Press the R key to increase the shoveling rate.\n\n"+
 "To stop adding coal to the fire\n"+
 "1. Press SHIFT+R to decrease the shoveling rate.\n"+
 "2. Press SHIFT+F to close the firebox door.\n\n"+
 "To operate the blower\n"+
 "1. Press the N key to increase the blower.\n"+
 "2. Press SHIFT+N to decrease the blower.\n\n"+
 "To operate the dampers\n"+
 "1. Press the M key to open the dampers.\n"+
 "2. Press SHIFT+M to close the dampers.\n\n"+
 "To inject water into the boiler\n"+
 "1. Press the I key to turn on the steam to Injector 1.\n"+
 "(You can also press the O key to turn on the steam to Injector 2.)\n"+
 "2. Press the K key to increase the water flow to Injector 1.\n"+
 "(To increase the water flow to Injector 2, press the L key.)\n\n"+
 "To stop boiler water injection\n"+ 
 "1. Press the I key to turn off the steam to Injector 1.\n"+
 "2. Press the O key to turn off the steam to Injector 2."
 )
)